import styles from '../styles/Home.module.css'

export default function Possibilities() {
    return (
        <div className={styles.container}>
            <title>Avast - Можливості</title>
        <main className={styles.main}>
            <h1 className={styles.title}>Можливості програми</h1>
            <div className={styles.text}>
            <p>Резидентний антивірусний сканер.</p> 
<p>Перевірка комп'ютера на віруси під час показу екранної заставки.</p> 
<p>Перевірка комп'ютера на віруси під час запуску, до повного завантаження операційної системи.</p> 
<p>Евристичний аналіз.</p> 
<p>Блокування шкідливих скриптів. До шостої версії ця можливість була присутня тільки в Professional Edition, потім стала доступна і користувачам Free Edition.</p> 
<p>Автоматичне оновлення антивірусних баз, а також самої програми.</p> 
<p>Вбудований в програму полегшений мережевий екран</p> 
<p>Резидентний захист здійснюється незалежними модулями</p> 
<p>Екран файлової системи — основний компонент сканера в реальному часі. Відстежує всі локальні операцій з файлами та папками на комп'ютері.</p> 
<p>Екран пошти — відстежує весь трафік програм для роботи з електронною поштою і сканує всі листи до того, як вони потраплять на комп'ютер, таким чином запобігаючи можливій шкоді. Здійснює перевірку трафіку по протоколах POP, SMTP, IMAP і NNTP.</p> 
<p>Веб-екран — аналізує всі дії користувача при відвідуванні веб-сайтів в Інтернеті.</p> 
<p>Екран P2P — відстежує завантаження більшості клієнтів файлообмінних мереж та торент-клієнтів.</p> 
<p>Екран інтернет-чатів — перехоплює всі завантаження з застосунків для миттєвого обміну повідомленнями і перевіряє їх на відсутність вірусів.</p> 
<p>Мережевий екран — відстежує всю мережеву активність і блокує віруси, які намагаються заразити систему через мережу. Крім того, екран блокує доступ до відомих шкідливих веб-сайтів.</p> 
<p>Екран сценаріїв — перехоплює всі сценарії, що виконуються в системі, як локальні.</p> 
<p>Видалення шпигунського програмного забезпечення з комп'ютера.</p> 
<p>Можливість встановлення пароля на зміну настройок програми.</p> 
<p>Багатомовний інтерфейс, підтримка 45 мов.</p> 
<p>Голосові повідомлення при виявленні шкідливої ​​програми і при успішному оновленні вірусної бази даних. До п'ятої версії використовувався чоловічий голос. Починаючи з п'ятої — жіночий.</p> 
<p>Антивірусний сканер командного рядка.</p> 
<p>Ведення VRDB .</p> 
<p>Починаючи з шостої версії, безкоштовний варіант антивірусу включає додаткову функцію WebRep. Ця функція інформує користувача про репутацію відвідуваних сайтів на підставі оцінок, виставлених спільнотою користувачів Avast!</p> 
<p>Підтримка скінів, однак, починаючи з п'ятої версії, ця можливість відсутня.</p> 
<p>Продукт сертифікований ICSA.</p> 
            </div>
        </main>
          <footer className={styles.footer}>
          </footer>
        </div>
      )
}